Revit 2027 API
FabricationPart.SetPartCustomDataText Method
 Set the custom data real value for the specified custom data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPartCustomDataText(
	int customId,
	string value
)
Public Sub SetPartCustomDataText (
	customId As Integer,
	value As String
)
public:
void SetPartCustomDataText(
	int customId,
	String^ value
)
member SetPartCustomDataText :
        customId : int *
        value : string -> unit
Parameters
customId Int32
 The identifier of the custom data field to set.
value String
 The text value of the custom data. If the data is not a text type the value will be parsed according to the fabrication confifuration rules.
Exceptions
Exception | Condition
ArgumentException |  The custom data does not exist on the part.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace